config/doom/config.org
#+title: Doom Emacs Configuration
#+property: header-args :tangle yes
#+auto_tangle: t


* Native Compilation
Enable native compilation of Emacs-Lisp.
#+begin_src elisp
(setq native-comp-deferred-compilation t)
#+end_src
* Variables
+ [[(langtool-fix)]] :: Fix for =LanguageTool= on NixOS (since the JAR isn't available).
+ [[(fine-undo)]] :: Instead of undo-ing an entire insert operation.
+ [[(subword-mode)]] :: Word navigation (with evil) respects CamelCase.

#+begin_src elisp
(setq auto-save-default t
      user-full-name "Ad"
      user-mail-address "me@adamorsomething.xyz"
      langtool-bin "/run/current-system/sw/bin/languagetool-commandline" ; (ref:langtool-fix)
      evil-want-fine-undo t)                                             ; (ref:fine-undo)
(global-subword-mode t)                                                  ; (ref:subword-mode)
#+end_src
* Functions
Given an ~org-mode~ buffer =BUFFER= (default current buffer), return its =TITLE= property.
#+begin_src elisp
(defun ad/get-org-buffer-title (&optional buffer)
  (with-current-buffer (or buffer (current-buffer))
    (nth 1 (car (org-collect-keywords '("TITLE"))))))
#+end_src

Create a custom ~org-agenda~ prefix of =LEN=.
#+begin_src elisp
(defun ad/custom-agenda-prefix (len)
  (if buffer-file-name
      (let ((len (if (string-empty-p time) len (- len (length time) 3)))
            (title (ad/get-org-buffer-title (find-file-noselect buffer-file-name))))
        (concat (if (> (length title) len)
                    (s-truncate len title "…")
                  (s-pad-right len " " title))
                (unless (string-empty-p time) "  ")
                time))
    (concat (make-string (- len (length time)) ? ) time)))
#+end_src
* Appearance
#+begin_src elisp
(setq display-line-numbers-type t
      doom-theme 'doom-one
      doom-font (font-spec :family "Comic Code Ligatures" :size 16)
      doom-variable-pitch-font (font-spec :family "Comic Neue" :size 16)
      doom-big-font-increment 6)
#+end_src

Enable italics for comments and keywords.
#+begin_src elisp
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

Make ~org-mode~ headlines, title, and info variable-pitched, varying size, and custom colors. The ~doom-color~ function gets the color from the current color theme.
#+begin_src elisp
(custom-set-faces!
  `(org-document-info  :inherit variable-pitch :height 1.0  :weight light  :slant italic)
  `(org-document-title :inherit variable-pitch :height 1.80 :weight bold   :slant italic)
  `(org-level-1        :inherit variable-pitch :height 1.70 :weight medium :foreground ,(doom-color 'blue))
  `(org-level-2        :inherit variable-pitch :height 1.60 :weight medium :foreground ,(doom-color 'magenta))
  `(org-level-3        :inherit variable-pitch :height 1.50 :weight medium :foreground ,(doom-color 'cyan))
  `(org-level-4        :inherit variable-pitch :height 1.40 :weight medium :foreground ,(doom-color 'violet))
  `(org-level-5        :inherit variable-pitch :height 1.30 :weight medium :foreground ,(doom-color 'teal))
  `(org-level-6        :inherit variable-pitch :height 1.20 :weight medium :foreground ,(doom-color 'green))
  `(org-level-7        :inherit variable-pitch :height 1.10 :weight medium :foreground ,(doom-color 'yellow))
  `(org-level-8        :inherit variable-pitch :height 1.00 :weight medium :foreground ,(doom-color 'orange)))
#+end_src

Enable =beacon.el= for cursor blinking on move. Perhaps replace this with Doom's =nav-flash= module one day? See [[https://github.com/doomemacs/doomemacs/issues/6169][this issue]].
#+begin_src elisp
(use-package! beacon
  :custom
  (beacon-blink-when-point-moves-vertically 10)
  (beacon-blink-when-point-moves-horizontally 20)
  (beacon-color "#D8DEE9")
  :config
  (beacon-mode t)
  (advice-add 'evil-scroll-up :after (lambda (&rest _) (beacon-blink)))
  (advice-add 'evil-scroll-down :after (lambda (&rest _) (beacon-blink))))
#+end_src
* Advice
Replace =sudo= with =doas=.
#+begin_src elisp
(define-advice doom--sudo-file-path (:around (orig-fun file))
  (s-replace "sudo" "doas" (apply orig-fun file nil)))
#+end_src

Make ~j~ and ~k~ navigate through visual lines instead of logical lines by default.
#+begin_src elisp
(after! evil
  (define-advice evil-line-move (:around (orig-fun count &optional noerror))
    (let ((line-move-visual t))
      (apply orig-fun count noerror))))
#+end_src
* Org-Mode
#+begin_src elisp
(setq org-directory "/home/ad/Sync/APP/")
#+end_src
** Appearance
#+begin_src elisp
(setq org-hide-emphasis-markers t
      org-startup-folded 'content
      org-ellipsis " […] "
      org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+"))
      org-reverse-note-order t)
#+end_src
** Keybindings
#+begin_src elisp
(map! (:map org-mode-map
       (:localleader
        :desc "org-edit-src-code" "E" #'org-edit-src-code
        :desc "org-latex-preview" "L" #'org-latex-preview
        :desc "org-babel-demarcate-block" "D" #'org-babel-demarcate-block)
       (:leader
        :prefix "i"
        :desc "org-attach-dir" "a" (cmd! (insert (org-attach-dir-get-create))))))

#+end_src
** Progress Logging
Agenda keywords, inspired by Doom's default keywords, just with logging and some custom ones. See https://orgmode.org/manual/Tracking-TODO-state-changes.html for more details. =DONE= doesn't have logging because otherwise custom time/note logs when moving away don't take effect; away-logging added to each word individually instead.
#+begin_src elisp
(after! org
  (setq org-todo-keywords '((sequence
                             "TODO(t/!)"
                             "PROJ(p/!)"
                             "STRT(s!/!)"
                             "WAIT(w@/@)"
                             "HOLD(h@/@)"
                             "IDEA(i/@)"
                             "READ(r/@)"
                             "|"
                             "DONE(d)"
                             "KILL(k@/@)")
                            (sequence
                             "[ ](T/!)"
                             "[-](S!)"
                             "[?](W@/@)"
                             "|"
                             "[X](D)"))
        org-todo-keyword-faces (append org-todo-keyword-faces
                                       '(("LOOK" . +org-todo-active)))))
#+end_src

Log notes and timestamps into drawers.
      #+begin_src elisp
(setq org-log-into-drawer t
      org-log-done 'time)
#+end_src

Prompt to clock into a task when it's marked as 'STRT'.
#+begin_src elisp
(add-hook! 'org-after-todo-state-change-hook
  (when (and (string-equal org-state "STRT")
             (y-or-n-p "Clock into this task?"))
    (org-clock-in)))
#+end_src
